<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#–í—Å–µ-–∑–∞–¥–∞–Ω–∏—è-–Ω—É–∂–Ω–æ-–≤—ã–ø–æ–ª–Ω–∏—Ç—å-—Ç–æ–ª—å–∫–æ-—Å-–ø–æ–º–æ—â—å—é-sql" data-toc-modified-id="–í—Å–µ-–∑–∞–¥–∞–Ω–∏—è-–Ω—É–∂–Ω–æ-–≤—ã–ø–æ–ª–Ω–∏—Ç—å-—Ç–æ–ª—å–∫–æ-—Å-–ø–æ–º–æ—â—å—é-sql-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>–í—Å–µ –∑–∞–¥–∞–Ω–∏—è –Ω—É–∂–Ω–æ –≤—ã–ø–æ–ª–Ω–∏—Ç—å —Ç–æ–ª—å–∫–æ —Å –ø–æ–º–æ—â—å—é sql</a></span></li></ul></div>

In [1]:
import sqlite3
import pandas as pd

In [2]:
con = sqlite3.connect(':memory:')

https://www.cs.toronto.edu/~delve/data/boston/bostonDetail.html

In [3]:
data = pd.read_csv('boston.csv')
data.head()

,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT,MEDV
0,0.00632,18.0,2.31,0.0,0.538,6.575,65.2,4.0900,1.0,296.0,15.3,396.90,4.98,24.0
1,0.02731,0.0,7.07,0.0,0.469,6.421,78.9,4.9671,2.0,242.0,17.8,396.90,9.14,21.6
2,0.02729,0.0,7.07,0.0,0.469,7.185,61.1,4.9671,2.0,242.0,17.8,392.83,4.03,34.7
3,0.03237,0.0,2.18,0.0,0.458,6.998,45.8,6.0622,3.0,222.0,18.7,394.63,2.94,33.4
4,0.06905,0.0,2.18,0.0,0.458,7.147,54.2,6.0622,3.0,222.0,18.7,396.90,5.33,36.2

In [4]:
data.to_sql('boston', con, index=False, if_exists='replace')

In [5]:
a = pd.read_sql(
    '''
    SELECT * FROM boston
    limit 5
    ''',
    con,
)
a

,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT,MEDV
0,0.00632,18.0,2.31,0.0,0.538,6.575,65.2,4.0900,1.0,296.0,15.3,396.90,4.98,24.0
1,0.02731,0.0,7.07,0.0,0.469,6.421,78.9,4.9671,2.0,242.0,17.8,396.90,9.14,21.6
2,0.02729,0.0,7.07,0.0,0.469,7.185,61.1,4.9671,2.0,242.0,17.8,392.83,4.03,34.7
3,0.03237,0.0,2.18,0.0,0.458,6.998,45.8,6.0622,3.0,222.0,18.7,394.63,2.94,33.4
4,0.06905,0.0,2.18,0.0,0.458,7.147,54.2,6.0622,3.0,222.0,18.7,396.90,5.33,36.2

In [6]:
tasks = 0

### –í—Å–µ –∑–∞–¥–∞–Ω–∏—è –Ω—É–∂–Ω–æ –≤—ã–ø–æ–ª–Ω–∏—Ç—å —Ç–æ–ª—å–∫–æ —Å –ø–æ–º–æ—â—å—é sql

1. –í—ã–≤–µ–¥–∏—Ç–µ –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ –ø—É—Å—Ç—ã—Ö –∑–Ω–∞—á–µ–Ω–∏–π –ø–æ –∫–æ–ª–æ–Ω–∫–∞–º CRIM, ZN, INDUS, CHAS, NOX (–Ω–∞–∑–≤–∞–Ω–∏–µ –∫–æ–ª–æ–Ω–∫–∏, –∫–æ–ª-–≤–æ –ø—É—Å—Ç—ã—Ö –∑–Ω–∞—á–µ–Ω–∏–π)

In [7]:
tasks+=1
pd.read_sql(
    '''
SELECT COUNT(*) cnt, 'CRIM'  variable FROM boston WHERE CRIM  IS NULL
    UNION ALL
SELECT COUNT(*) cnt, 'ZN'    variable FROM boston WHERE ZN    IS NULL
    UNION ALL
SELECT COUNT(*) cnt, 'INDUS' variable FROM boston WHERE INDUS IS NULL
    UNION ALL
SELECT COUNT(*) cnt, 'CHAS'  variable FROM boston WHERE CHAS  IS NULL
    UNION ALL
SELECT COUNT(*) cnt, 'NOX'   variable FROM boston WHERE NOX   IS NULL
    ''',
    con,
)

   cnt variable
0    0     CRIM
1    0       ZN
2    0    INDUS
3    0     CHAS
4    0      NOX

2. –í—ã–≤–µ–¥–∏—Ç–µ –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ —É–Ω–∏–∫–∞–ª—å–Ω—ã—Ö –∑–Ω–∞—á–µ–Ω–∏–π –ø–æ –∫–æ–ª–æ–Ω–æ–∫–∞–º CRIM, ZN, INDUS, CHAS, NOX (–Ω–∞–∑–≤–∞–Ω–∏–µ –∫–æ–ª–æ–Ω–∫–∏, –∫–æ–ª-–≤–æ —É–Ω–∏–∫–∞–ª—å–Ω—ã—Ö –∑–Ω–∞—á–µ–Ω–∏–π)

In [8]:
tasks+=1

pd.read_sql(
    '''
SELECT COUNT(*) cnt, 'CRIM'  variable FROM (SELECT DISTINCT CRIM  FROM boston)
    UNION ALL
SELECT COUNT(*) cnt, 'ZN'    variable FROM (SELECT DISTINCT ZN    FROM boston)
    UNION ALL
SELECT COUNT(*) cnt, 'INDUS' variable FROM (SELECT DISTINCT INDUS FROM boston)
    UNION ALL
SELECT COUNT(*) cnt, 'CHAS'  variable FROM (SELECT DISTINCT CHAS  FROM boston)
    UNION ALL
SELECT COUNT(*) cnt, 'NOX'   variable FROM (SELECT DISTINCT NOX   FROM boston)
    ''',
    con,
)

   cnt variable
0  504     CRIM
1   26       ZN
2   76    INDUS
3    2     CHAS
4   81      NOX

3. –í—ã–≤–µ–¥–∏—Ç–µ –∫–æ–ª–æ–Ω–∫–∏, —É –∫–æ—Ç–æ—Ä—ã—Ö –º–µ–¥–∏–∞–Ω–∞ —Ä–∞–≤–Ω–∞ –º–∏–Ω–∏–º–∞–ª—å–Ω–æ–º—É –∑–Ω–∞—á–µ–Ω–∏—é (–Ω–∞–∑–≤–∞–Ω–∏–µ –∫–æ–ª–æ–Ω–∫–∏) –≤—ã–±–∏—Ä–∞—è –∏–∑ CRIM, ZN, INDUS, CHAS, NOX.
–ù–∞–ø–∏—à–∏—Ç–µ –∫–∞–∫–æ–π –≤—ã–≤–æ–¥ –º–æ–∂–Ω–æ —Å–¥–µ–ª–∞—Ç—å –ø–æ –¥–∞–Ω–Ω—ã–º –≤ —ç—Ç–∏—Ö –∫–æ–ª–æ–Ω–∫–∞—Ö

In [9]:
tasks+=1

pd.read_sql(
    ''' WITH step_1 AS (
                SELECT 
                  'CRIM' name, 
                   CRIM value 
                FROM boston
                UNION ALL
                
                SELECT 
                  'ZN' name, 
                   ZN value 
                FROM boston
                UNION ALL
                
                SELECT 
                  'INDUS' name, 
                  INDUS value 
                FROM boston
                UNION ALL
                
                SELECT 
                  'CHAS' name, 
                   CHAS value 
                FROM boston
                UNION ALL
                
                SELECT 
                  'NOX' name, 
                   NOX value 
                FROM boston ),
                
            step_2 AS ( SELECT 
                          name, 
                          value,
                          ROW_NUMBER() OVER(PARTITION BY name ORDER BY value) as rn,
                          MIN(value) OVER(PARTITION BY name) min_value,
                          COUNT(value) OVER(PARTITION BY name) as cnt
                        FROM step_1 )
            SELECT name 
            FROM (  SELECT 
                      name, 
                      value as md_value, 
                      min_value
                    FROM step_2
                    WHERE rn = cnt/2 )
            WHERE md_value = min_value
    ''',
    con
)

   name
0  CHAS
1    ZN

–í—ã–≤–æ–¥: –º–∏–Ω–∏–º–∞–ª—å–Ω—ã–µ –∑–Ω–∞—á–µ–Ω–∏—è –≤—ã—è–≤–ª–µ–Ω—ã —É –¥–≤—É—Ö —Å—Ç–æ–ª–±—Ü–æ–≤.

4. –í—ã–≤–µ–¥–∏—Ç–µ —Ä–∞–∑–Ω–∏—Ü—É –º–µ–∂–¥—É —Å—Ä–µ–¥–Ω–µ–º –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ–º –∫–æ–º–Ω–∞—Ç(RM) –≤ –¥–æ–º–∞—Ö —Å —Å–∞–º–æ–π –¥–æ—Ä–æ–≥–æ–π —Å—Ç–æ–∏–º–æ—Å—Ç—å—é(MEDV) –∏ 25 —Å–∞–º—ã–º–∏ –¥–µ—à–µ–≤—ã–º–∏ –¥–æ–º–∞–º–∏. 
–ê–Ω–∞–ª–æ–≥–∏—á–Ω–æ –ø–æ 50, 100, 200, 300 —Å–∞–º—ã–º–∏ –¥–µ—à–µ–≤—ã–º–∏ –¥–æ–º–∞–º–∏. (–∫–æ–ª-–≤–æ –¥–æ–º–æ–≤(25,50,100,200,300), —Å—Ä–µ–¥–Ω–µ–µ –∫–æ–ª-–≤–æ –∫–æ–º–Ω–∞—Ç –≤ –Ω–∏—Ö, —Å—Ä–µ–¥–Ω–µ–µ –∫–æ–ª-–≤–æ –∫–æ–º–Ω–∞—Ç –≤ —Å–∞–º—ã—Ö –¥–æ—Ä–æ–≥–∏—Ö, —Ä–∞–∑–Ω–∏—Ü–∞).
–ù–∞–ø–∏—à–∏—Ç–µ –≤–ª–∏—è–µ—Ç –ª–∏ –∫–æ–ª-–≤–æ –∫–æ–º–Ω–∞—Ç –Ω–∞ —Å—Ç–æ–∏–º–æ—Å—Ç—å –∏ –∫–∞–∫ —Å–∏–ª—å–Ω–æ.

In [10]:
tasks+=1
pd.read_sql('''
WITH high_price AS ( SELECT avg(rm) AS avg_high FROM boston GROUP BY medv ORDER BY medv DESC LIMIT 1),
       limit_25 AS ( SELECT 'limit 25'  category, avg(rm) rm_avg, avg_high rm_avg_h, avg_high-avg(rm) diff FROM ( SELECT rm, medv FROM boston ORDER BY medv ASC LIMIT 25),  high_price),
       limit_50 AS ( SELECT 'limit 50'  category, avg(rm) rm_avg, avg_high rm_avg_h, avg_high-avg(rm) diff FROM ( SELECT rm, medv FROM boston ORDER BY medv ASC LIMIT 50),  high_price),
      limit_100 AS ( SELECT 'limit 100' category, avg(rm) rm_avg, avg_high rm_avg_h, avg_high-avg(rm) diff FROM ( SELECT rm, medv FROM boston ORDER BY medv ASC LIMIT 100), high_price), 
      limit_200 AS ( SELECT 'limit 200' category, avg(rm) rm_avg, avg_high rm_avg_h, avg_high-avg(rm) diff FROM ( SELECT rm, medv FROM boston ORDER BY medv ASC LIMIT 200), high_price),
      limit_300 AS ( SELECT 'limit 300' category, avg(rm) rm_avg, avg_high rm_avg_h, avg_high-avg(rm) diff FROM ( SELECT rm, medv FROM boston ORDER BY medv ASC LIMIT 300), high_price)
    
    SELECT * FROM limit_25
    UNION ALL
    SELECT * FROM limit_50
    UNION ALL
    SELECT * FROM limit_100
    UNION ALL
    SELECT * FROM limit_200
    UNION ALL
    SELECT * FROM limit_300
    ''',
    con,
)

    category    rm_avg  rm_avg_h      diff
0   limit 25  5.747840     7.484  1.736160
1   limit 50  5.753240     7.484  1.730760
2  limit 100  5.887120     7.484  1.596880
3  limit 200  5.911705     7.484  1.572295
4  limit 300  5.972227     7.484  1.511773

In [11]:
# –í—ã–≤–æ–¥: –û–¥–Ω–æ–∑–Ω–∞—á–Ω–æ–≥–æ –æ—Ç–≤–µ—Ç–∞ —Å–æ–≥–ª–∞—Å–Ω–æ —Ä–∞—Å—Å—á–µ—Ç—Ä–Ω–æ–π —á–∞—Å—Ç–∏ –Ω–µ—Ç. –û–¥–Ω–∞–∫–æ –¥–∞–∂–µ –ª–æ–≥–∏—á–µ—Å–∫–∏ –µ—Å–ª–∏ –ø–æ–¥—É–º–∞—Ç—å –±–æ–ª—å—à–µ –ø–ª–æ—â–∞—Ç—å –±–æ–ª—å—à–µ —Å—Ç–æ–∏–º–æ—Å—Ç—å.

5. –í—ã–≤–µ–¥–∏—Ç–µ —Ä–∞–Ω–≥–∏ –∑–Ω–∞—á–µ–Ω–∏–π –∫–æ–ª–æ–Ω–∫–∏ LSTAT(–ø—Ä–æ—Ü–µ–Ω—Ç –Ω–∞—Å–µ–ª–µ–Ω–∏—è —Å –±–æ–ª–µ–µ –Ω–∏–∑–∫–∏–º —Å—Ç–∞—Ç—É—Å–æ–º) –≤ –¥–æ–º–∞—Ö —Å —Å–∞–º–æ–π –¥–æ—Ä–æ–≥–æ–π —Å—Ç–æ–∏–º–æ—Å—Ç—å—é (–∑–Ω–∞—á–µ–Ω–∏–µ LSTAT, —Å—Ç–æ–∏–º–æ—Å—Ç—å, —Ä–∞–Ω–≥) —Å—Ä–µ–¥–∏ –≤—Å–µ—Ö –∑–Ω–∞—á–µ–Ω–∏–π LSTAT. –ù–∞–ø–∏—à–∏—Ç–µ –∫–∞–∫–æ–π –≤—ã–≤–æ–¥ –º–æ–∂–Ω–æ —Å–¥–µ–ª–∞—Ç—å –ø–æ —ç—Ç–∏–º –¥–∞–Ω–Ω—ã–º.

In [12]:
tasks+=1
print('–í—ã–≤–æ–¥:  –≤ –¥–æ—Ä–æ–≥–∏—Ö –¥–æ–º–∞—Ö –Ω–∏–∑–∫–∞—è —á–∏—Å–ª–µ–Ω–Ω–æ—Å—Ç—å –Ω–∞—Å–µ–ª–µ–Ω–∏—è —Å –Ω–∏–∑–∫–∏–º —Å—Ç–∞—Ç—É—Å–æ–º')
pd.read_sql(
    """
    SELECT 
      rank,
      LSTAT,
      MEDV  
    FROM ( SELECT 
             MEDV,
             LSTAT,
             RANK() OVER(ORDER BY LSTAT) rank,
             MAX(MEDV) over() max_
           FROM boston )
    WHERE MEDV = max_
    """,
    con,
)

–í—ã–≤–æ–¥:  –≤ –¥–æ—Ä–æ–≥–∏—Ö –¥–æ–º–∞—Ö –Ω–∏–∑–∫–∞—è —á–∏—Å–ª–µ–Ω–Ω–æ—Å—Ç—å –Ω–∞—Å–µ–ª–µ–Ω–∏—è —Å –Ω–∏–∑–∫–∏–º —Å—Ç–∞—Ç—É—Å–æ–º

    rank  LSTAT  MEDV
0      1   1.73  50.0
1      2   1.92  50.0
2      6   2.88  50.0
3      8   2.96  50.0
4      9   2.97  50.0
5     15   3.16  50.0
6     17   3.26  50.0
7     18   3.32  50.0
8     26   3.70  50.0
9     27   3.73  50.0
10    41   4.45  50.0
11    50   4.63  50.0
12    67   5.12  50.0
13   141   7.44  50.0
14   181   8.88  50.0
15   203   9.53  50.0

6. –í—ã–≤–µ–¥–∏—Ç–µ —Å—Ä–µ–¥–Ω—é—é —Å—Ç–æ–∏–º–æ—Å—Ç—å –¥–æ–º–æ–≤ –≥—Ä–∞–Ω–∏—á–∞—â–∏—Ö —Å —Ä–µ–∫–æ–π(CHAS) –∏ –Ω–µ—Ç (–≥—Ä–∞–Ω–∏—á–∏—Ç/–Ω–µ –≥—Ä–∞–Ω–∏—á–∏—Ç, —Å—Ç–æ–∏–º–æ—Å—Ç—å)

In [13]:
tasks+=1
pd.read_sql(
    """
    SELECT DISTINCT 
      (CASE
        WHEN CHAS = 1 THEN '–ì—Ä–∞–Ω–∏—á–∏—Ç'
        ELSE '–ù–µ –≥—Ä–∞–Ω–∏—á–∏—Ç'
      END) CHAS,
      round(avg(MEDV) over(PARTITION BY CHAS)) avg_MEDV
    FROM boston
    """,
    con,
)

          CHAS  avg_MEDV
0  –ù–µ –≥—Ä–∞–Ω–∏—á–∏—Ç      22.0
1     –ì—Ä–∞–Ω–∏—á–∏—Ç      28.0

7. –í—ã–≤–µ–¥–∏—Ç–µ –≤—Å–µ –∫–æ–ª–æ–Ω–∫–∏, —É –∫–æ—Ç–æ—Ä—ã—Ö —Å—Ä–µ–¥–Ω–µ–µ –∑–Ω–∞—á–µ–Ω–∏–µ –≤—ã—à–µ, –∫–æ–≥–¥–∞ –¥–æ–º –≥—Ä–∞–Ω–∏—á–∏—Ç —Å —Ä–µ–∫–æ–π (–Ω–∞–∑–≤–∞–Ω–∏–µ –∫–æ–ª–æ–Ω–∫–∏) –≤—ã–±–∏—Ä–∞—è –∏–∑ CRIM, ZN, INDUS, CHAS, NOX. –ù–∞–ø–∏—à–∏—Ç–µ –∫–∞–∫–æ–π –≤—ã–≤–æ–¥ –º–æ–∂–Ω–æ —Å–¥–µ–ª–∞—Ç—å –ø–æ —ç—Ç–∏–º –¥–∞–Ω–Ω—ã–º.

In [14]:
tasks+=1
pd.read_sql(
    """
    SELECT col_name FROM 
    (SELECT 
        'CRIM' AS col_name, 
        (SELECT avg(crim) FROM boston WHERE chas=1)>avg(crim) AS flag
    FROM boston
    UNION
    SELECT 
        'ZN' AS col_name, 
        (SELECT avg(ZN) FROM boston WHERE chas=1)>avg(ZN) AS flag
    FROM boston
    UNION
    SELECT 
        'INDUS' AS col_name, 
        (SELECT avg(INDUS) FROM boston WHERE chas=1)>avg(INDUS) AS flag
    FROM boston
    
    
    
    UNION
    SELECT 
        'CHAS' AS col_name, 
        (SELECT avg(CHAS) FROM boston WHERE chas=1)>avg(CHAS) AS flag
    FROM boston   
    
    UNION
    SELECT 
        'NOX' AS col_name, 
        (SELECT avg(NOX) FROM boston WHERE chas=1)>avg(NOX) AS flag
    FROM boston
    )
    WHERE flag = 1
    """,
    con,
)
# –†—è–¥–æ–º —Å —Ä–µ–∫–æ–π –º–Ω–æ–≥–æ –ø—Ä–æ–º—ã—à–ª–µ–Ω–Ω—ã—Ö –æ–±—ä–µ–∫—Ç–æ–≤

  col_name
0     CHAS
1    INDUS
2      NOX

8. –í—ã–≤–µ–¥–∏—Ç–µ –∑–Ω–∞—á–µ–Ω–∏—è –¥–æ–ª–µ–π –ø—Ä–æ–º—ã—à–ª–µ–Ω–Ω–æ–π –∑–∞—Å—Ç—Ä–æ–π–∫–∏(INDUS), –∫–æ–Ω—Ü–µ–Ω—Ç—Ä–∞—Ü–∏–∏ –æ–∫—Å–∏–¥–æ–≤ –∞–∑–æ—Ç–∞(NOX) –∏ –ø–æ –∏—Ö –ø–µ—Ä—Ü–µ–Ω—Ç–∏–ª—è–º - 10, 20 ... 100 ( –ø–µ—Ä—Ü–µ—Ç–∏–ª—å(10,20...100),–∑–Ω–∞—á–µ–Ω–∏–µ INDUS, –∑–Ω–∞—á–µ–Ω–∏–µ NOX). –ù–∞–ø–∏—à–∏—Ç–µ –ø—Ä–æ—Å–ª–µ–∂–∏–≤–∞–µ—Ç—Å—è –º–µ–∂–¥—É –Ω–∏–º–∏ –≤–∑–∞–∏–º–æ—Å–≤—è–∑—å

In [15]:
tasks+=1
print('–ï—Å—Ç—å —Å–≤—è–∑—å –º–µ–∂–¥—É –¥–æ–ª–µ–π –∑–∞—Å—Ç—Ä–æ–π–∫–∏ –∏ –∫–æ–Ω—Ü–µ–Ω—Ç—Ä–∞—Ü–∏–µ–π –∞–∑–æ—Ç–∞')
pd.read_sql( """
       WITH step_1 AS (SELECT 
                         INDUS, 
                         NTILE(10) OVER (ORDER BY INDUS) percentile
                       FROM boston),
                   
        step_2 AS (SELECT 
                  NOX, 
                  NTILE(10) OVER (ORDER BY NOX) percentile
                FROM boston)    
select 
  a.percentile * 10 as percentile ,
  a.indus,
  b.nox 
from (SELECT 
        percentile, 
        MAX(indus) as indus
      FROM step_1
      GROUP BY percentile) a
      LEFT JOIN (SELECT 
                   percentile, 
                   MAX(nox) as nox
                 FROM step_2
                 GROUP BY percentile) b ON a.percentile = b.percentile 
    """,
    con
)

–ï—Å—Ç—å —Å–≤—è–∑—å –º–µ–∂–¥—É –¥–æ–ª–µ–π –∑–∞—Å—Ç—Ä–æ–π–∫–∏ –∏ –∫–æ–Ω—Ü–µ–Ω—Ç—Ä–∞—Ü–∏–µ–π –∞–∑–æ—Ç–∞

   percentile  indus    nox
0          10   2.89  0.426
1          20   4.39  0.442
2          30   5.96  0.472
3          40   7.38  0.507
4          50   9.69  0.538
5          60  13.89  0.580
6          70  18.10  0.609
7          80  18.10  0.671
8          90  19.58  0.713
9         100  27.74  0.871

CRIM - —É—Ä–æ–≤–µ–Ω—å –ø—Ä–µ—Å—Ç—É–ø–Ω–æ—Å—Ç–∏ –Ω–∞ –¥—É—à—É –Ω–∞—Å–µ–ª–µ–Ω–∏—è
ZN - –¥–æ–ª—è –∑–µ–º–µ–ª—å –ø–æ–¥ –∂–∏–ª—É—é –∑–∞—Å—Ç—Ä–æ–π–∫—É –∑–æ–Ω–∏—Ä–æ–≤–∞–Ω–∞ –ø–æ–¥ —É—á–∞—Å—Ç–∫–∏ –ø–ª–æ—â–∞–¥—å—é –±–æ–ª–µ–µ 25 000 –∫–≤. —Ñ—É—Ç–æ–≤.
INDUS - –¥–æ–ª—è –∞–∫—Ä–æ–≤ –Ω–µ—Ç–æ—Ä–≥–æ–≤–æ–≥–æ –±–∏–∑–Ω–µ—Å–∞ –Ω–∞ –≥–æ—Ä–æ–¥.
CHAS - 1, –µ—Å–ª–∏ –≥—Ä–∞–Ω–∏—á–∏—Ç —Å —Ä–µ–∫–æ–π, 0 –∏–Ω–∞—á–µ
NOX - –∫–æ–Ω—Ü–µ–Ω—Ç—Ä–∞—Ü–∏—è –æ–∫—Å–∏–¥–æ–≤ –∞–∑–æ—Ç–∞ (—á–∞—Å—Ç–µ–π –Ω–∞ 10 –º–∏–ª–ª–∏–æ–Ω–æ–≤)
RM - —Å—Ä–µ–¥–Ω–µ–µ –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ –∫–æ–º–Ω–∞—Ç –≤ –∫–≤–∞—Ä—Ç–∏—Ä–µ
AGE - –¥–æ–ª—è –∂–∏–ª—ã—Ö –¥–æ–º–æ–≤, –ø–æ—Å—Ç—Ä–æ–µ–Ω–Ω—ã—Ö –¥–æ 1940 –≥.
DIS - –≤–∑–≤–µ—à–µ–Ω–Ω—ã–µ —Ä–∞—Å—Å—Ç–æ—è–Ω–∏—è –¥–æ –ø—è—Ç–∏ —Ü–µ–Ω—Ç—Ä–æ–≤ –∑–∞–Ω—è—Ç–æ—Å—Ç–∏ –ë–æ—Å—Ç–æ–Ω–∞
RAD - –∏–Ω–¥–µ–∫—Å –¥–æ—Å—Ç—É–ø–Ω–æ—Å—Ç–∏ –∫ —Ä–∞–¥–∏–∞–ª—å–Ω—ã–º –º–∞–≥–∏—Å—Ç—Ä–∞–ª—è–º
TAX - –ø–æ–ª–Ω–∞—è —Å—Ç–∞–≤–∫–∞ –Ω–∞–ª–æ–≥–∞ –Ω–∞ –∏–º—É—â–µ—Å—Ç–≤–æ –∑–∞ 10 000 –¥–æ–ª–ª–∞—Ä–æ–≤ –°–®–ê
PTRATIO - —Å–æ–æ—Ç–Ω–æ—à–µ–Ω–∏–µ —É—á–µ–Ω–∏–∫–æ–≤ –∏ —É—á–∏—Ç–µ–ª–µ–π –ø–æ –≥–æ—Ä–æ–¥–∞–º
B - 1000(Bk - 0.63)^2, –≥–¥–µ Bk –¥–æ–ª—è —á–µ—Ä–Ω–æ–∫–æ–∂–∏—Ö –ª—é–¥–µ–π –ø–æ –≥–æ—Ä–æ–¥–∞–º
LSTAT - % –±–æ–ª–µ–µ –Ω–∏–∑–∫–æ–≥–æ —Å—Ç–∞—Ç—É—Å–∞ –Ω–∞—Å–µ–ª–µ–Ω–∏—è
MEDV - –°—Ä–µ–¥–Ω—è—è —Å—Ç–æ–∏–º–æ—Å—Ç—å –¥–æ–º–æ–≤ –≤ 1000 –¥–æ–ª–ª–∞—Ä–æ–≤.

In [16]:
if tasks==8:
    print('–í—ã–ø–æ–ª–Ω–µ–Ω—ã –≤—Å–µ –∑–∞–¥–∞–Ω–∏—è üôÇ')
else:
    print('–í—ã–ø–æ–ª–Ω–µ–Ω—ã –Ω–µ –≤—Å–µ –∑–∞–¥–∞–Ω–∏—è! üôÄ')

–í—ã–ø–æ–ª–Ω–µ–Ω—ã –≤—Å–µ –∑–∞–¥–∞–Ω–∏—è üôÇ